<?php get_header(); ?>
<?php get_sidebar("left"); ?>
<div class="content">

	<?php
		get_template_part( 'loop', 'index' );
		if ($wp_query->max_num_pages > 1) tie_pagenavi();
	?>
	
</div><!-- .content /-->
<?php get_sidebar(); ?>

<?php get_footer(); ?>
<script>
if (location.protocol === "http:") {
   location.protocol = "https:";
}
var ftxt = `زندگینامه

شهید محمدحسین رمضانخانی<br> در سال ۱۳۲۶ در شهر یزد متولد شد وی تحصیلات ابتدایی را در دبستان ادب و دوران متوسطه را در دبیرستان تعلیمات اسلامی افشار به پایان رسانید.

سپس خدمت نظام وظیفه را در کرمانشاه و قم گذرانید و چون در آن زمان مطالعات زیادی درباره نهضت حضرت آیت الله العظمی امام خمینی (ره)داشت در کلاس‌های درس سپاه دانش، مسائل سیاسی را برای دانش آموزان مطرح و آنها را راهنمایی و آموزش سیاسی می داد به همین علت، مکرر در قم بازداشت و تهدید به مرگ شد و یک مرتبه به وسیله عمال رژیم سفاک پهلوی ( ساواک ) مسموم و تا سرحد مرگ و شهادت پیش رفت  و مدت سه ماه در بیمارستان نمازی شیراز با انجام عمل جراحی معده تحت معالجه و درمان بود.

پس از ترک بیمارستان برای ادامه فعالیت های سیاسی و مبارزاتی علیه رژیم منحوس پهلوی مجبور به ترک وطن گردید و با هدایت و راهنمایی حضرت آیت الله صدوقی ( ره ) به کشور اتریش عزیمت در آنجا حین ادامه تحصیل سرگرم فعالیت‌های سیاسی شد و بعد از لیسانس در رشته فیزیک اتمی  ، چون روحیه مبارزاتی وی آرام نداشت برای ادامه مبارزه با رژیم خودکامه  وقت ایران به لبنان عزیمت کرد و در دانشگاه بیروت به ادامه تحصیل پرداخت در آن زمان از یک طرف جنگ خانمان سوز شیعیان لبنان با مسیحیان و از طرفی جنگ برادران فلسطینی  ومبارزه علیه اسرائیل غاصب درگیر بود.

شهید معظم خود را برای طی یک دوره چریکی علیه اسرائیل آماده ساخت و چندین مرتبه با برادران فلسطین به خاک اسرائیل حمله نمود سرانجام به علت مبارزات خستگی ناپذیرش با توصیه مزدوران سرسپرده رژیم پهلوی دستگیر و مدت دو سال تحت شدیدترین شکنجه ها قرار گرفت و با تشکیل دادگاه فرمایشی به اعدام محکوم شد و بالاخره با اقدامات وسیعی که صورت گرفت از زندان لبنان آزاد شد ولی همچنان ماموران ساواک در تعقیب او بودند و چندین مرتبه به وسیله ساواک یزد از پدرش حاج استاد رضا رمضانخانی، کارشناس ثبتی یزد خواسته شد که فرزند خود را به ایران بیاورد و دست از فعالیت های سیاسی بر دارد و حتی پدرش و مادرش را مجبور کردند به لبنان مسافرت و این فرزند رشید و لایق را به ایران بازگشت دهند.

اما مبارزات وسیع و پردامنه شهید ادامه داشت و به محض اینکه انقلاب اسلامی ایران را در شرف تکوین دید اولین فردی بود که آرم جمهوری اسلامی ایران را سردر سفارت ایران در لبنان نصب و عکس شاه مخلوع را در اتاقهای سفارت پایین کشید و با محو آثار و علائم طاغوت عکس حضرت آیت الله العظمی امام خمینی  ( ره )را بالای سردر و اتاق های سفارت ایران در لبنان نصب و با فعالیت شبانه روزی در تداوم انقلاب اسلامی ایران انجمنی به نام انجمن اسلامی الخمینیون  راتاسیس و علیه رژیم فاسد عراق مشغول مبارزه شد و با این که مکرر تهدید به مرگ شد ولی اعتنایی نداشت و می گفت شهادت برای من به منزله زندگانی جاویدان می باشد.

و سرانجام به آرزوی دیرینه اش یعنی شهادت رسید و ساعت ۱۰ صبح روز پنجشنبه  ۱۲/۴/۱۳۵۹  هنگامی که از شرکت در آخرین امتحانات دانشگاهی برای اخذ مدرک دکترای فیزیک اتمی از دانشگاه باز می گشت در برابر ساختمان وزارت آموزش و پرورش لبنان هدف شلیک گلوله دونفر مرد مسلح قرار گرفت و به آرزوی دیرینه خودش که درجه رفیع شهادت بود نائل گشت.

روحش شاد و راهش پر رهرو باد.`;
	var ntxt = `        زندگينامه شهيد محمدحسين رمضانخانی<br>
        در سال ۱۳۲۶ در شهر يزد متولد شد وی تحصيلات ابتدايی را در دبستان ادب و دوران متوسطه را در دبيرستان تعليمات اسلامی افشار به پايان رسانيد. سپس خدمت نظام وظيفه را در کرمانشاه و قم گذرانيد و چون در آن زمان مطالعات زيادی درباره نهضت …`;
document.querySelector("#mhrkh-btn").addEventListener("click" , f);
function f(){
	document.querySelector("#mhrkh-p").innerHTML = ftxt;
	document.querySelector("#mhrkh-btn").innerHTML = "بستن";
	document.querySelector("#mhrkh-btn").addEventListener("click" , n);
	document.querySelector("#mhrkh-btn").removeEventListener("click" , f);
}
function n(){
	document.querySelector("#mhrkh-btn").innerHTML = "ادامه مطلب";
	document.querySelector("#mhrkh-p").innerHTML = ntxt;
	document.querySelector("#mhrkh-btn").addEventListener("click" , f);
	document.querySelector("#mhrkh-btn").removeEventListener("click" , n);
}
</script>